# colors2

  Examples:
```
think colors(*yellow*)
greenyellow yellowgreen lightgoldenrodyellow lightyellow yellow lightyellow1 lightyellow2 lightyellow3 lightyellow4 yellow1 yellow2 yellow3 yellow4
```

```
    > think colors(+yellow, hex)
    #ffff00
```
```
    > think colors(+yellow, xterm256)
    226
```
```
    > think colors(+yellow, 16color)
    yh
```
```
    > think colors(/+yellow, 16color)
    Y
```
```
    > think colors(#ffff00, name)
    yellow yellow1
```
```
    > think colors(iuB+red, hex styles)
    ui#ff0000/#0000ee
```
```
    > think colors(+blue huyG/+black, auto)
    hy/+black
```


